<?php
defined('BASEPATH') or exit('No direct script access allowed');
?>
<!DOCTYPE html>
<html>

<head>
	<meta charset="UTF-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>แบบคำร้องแก้ไขผลการเรียน</title>

	<link rel="stylesheet" href="<?= base_url('assets/font/font.css') ?>">
	<link rel="stylesheet" href="<?= base_url('assets/css/reset.css') ?>">
	<link rel="stylesheet" href="<?= base_url('assets/css/print/edit0.css') ?>">
</head>

<body>
	<div class="pagebreak">
		<!-- <div class="data">
			
		</div> -->

		<p class="text-right b lh-1-5">
			วผ. ๐๘
		</p>
		<p class="text-right lh-1-5">
			• (ส่วนที่ 1 วัดผลแผนกวิชารวบรวมส่งสำหรับงานวัดผล)
		</p>
		<p class="text-center b lh-1-5">
			แบบคำร้องแก้ไขผลการเรียน
		</p>
		<p class="lh-1-5">
			เรื่อง ขออนุญาตแก้ไขผลการเรียน 0/มส
			<br>
			เรียน ผู้อำนวยการวิทยาลัยการอาชีพแก้งคร้อ
		</p>
		<span class="ts-8 lh-1">&nbsp;</span>

		<p class="indent">
			ข้าพเจ้า(นาย/นางสาว)........................................................รหัสประจำตัวนักเรียนนักศึกษา..............................................
			<br>เป็นนักเรียนนักศึกษาหลักสูตร......................แผนกวิชา..........................................ชั้นปีที่..........................กลุ่ม.............................
		</p>
		<p class="indent">
			มีความประสงค์ขอแก้ไขผลการเรียน 0/มส ประจำภาคเรียนที่......................................ปีการศึกษา...................................
			<br>วิชา................................................รหัสวิชา...................................จำนวนหน่วยกิต...................ชื่อครูผู้สอน..................................
		</p>

		<p class="indent">
			จึงเรียนมาเพื่อโปรดพิจารณาอนุญาต
		</p>


		<div class="text-right" style="padding-right: 3em;">
			ขอแสดงความนับถือ&emsp;&emsp;&emsp;&emsp;
		</div>
		<div class="text-right mt" style="padding-right: 3em;">
			ลงชื่อ..............................................ผู้ยื่นคำร้อง
			<br>(..........................................................)&ensp;&emsp;&nbsp;
		</div>

		<p class="line">
			&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;
		</p>

		<p class="text-right lh-1-5">
			(ส่วนที่ 2 สำหรับครูผู้สอนเก็บไว้)
		</p>
		<span class="ts-8 lh-1">&nbsp;</span>

		<p class="indent">
			ตามที่(นาย/นางสาว)................................................................รหัสประจำตัวนักเรียนนักศึกษา.........................................
			<br>เป็นนักเรียนนักศึกษาหลักสูตร......................แผนกวิชา...................................................ชั้นปีที่...........................กลุ่ม...................
		</p>
		<p class="indent">
			นักเรียน นักศึกษาได้ยื่นคำร้องขอแก้ไขผลการเรียน 0/มส วิชา.........................................................................................
			<br>ประจำภาคเรียนที่......................./....................
		</p>
		<span class="ts-8 lh-1">&nbsp;</span>

		<div class="text-right mt" style="padding-right: 1.5em;">
			ลงชื่อ..............................................นักเรียน/นักศึกษา
			<br>(..........................................................)&ensp;&emsp;&emsp;&ensp;
		</div>

		<p class="line">
			&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;&#x2702;
		</p>

		<!-- &#9711; -->
	</div>

	<div class="pagebreak">
		<p class="text-right lh-1-5">
			(ส่วนที่ 3 สำหรับนักเรียนเก็บไว้)
		</p>
		<span class="lh-1">&nbsp;</span>

		<p class="indent">
			ตามที่(นาย/นางสาว).................................................................รหัสประจำตัวนักเรียนนักศึกษา........................................
			<br>เป็นนักเรียนนักศึกษาหลักสูตร......................แผนกวิชา.........................................................ชั้นปีที่....................กลุ่ม....................
		</p>
		<p class="indent">
			นักเรียน นักศึกษาได้ยื่นคำร้องขอแก้ไขผลการเรียน 0/มส มอบหมายให้นักเรียนนักศึกษาวิชา..........................................
			<br>ประจำภาคเรียนที่.......................ปีการศึกษา....................เรียบร้อยแล้ว และจะดำเนินการแก้ไขผลการเรียนต่อไป
		</p>
		<span class="ts-8 lh-1">&nbsp;</span>

		<div class="text-right mt" style="padding-right: 1.5em;">
			ลงชื่อ..............................................ครูผู้สอนประจำวิชา
			<br>(..........................................................)&ensp;&emsp;&emsp;&ensp;
		</div>
	</div>



	<script type="text/javascript">
		// window.onload = function() {
		// 	window.print();
		// }
	</script>
</body>

</html>
