<?php
defined('BASEPATH') or exit('No direct script access allowed');
?>
<!DOCTYPE html>
<html>

<head>
	<meta charset="UTF-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>หนังสือคําร้องขอฝึกอาชีพในสถานประกอบการ</title>

	<link rel="stylesheet" href="<?= base_url('assets/font/font.css') ?>">
	<link rel="stylesheet" href="<?= base_url('assets/css/reset.css') ?>">
	<link rel="stylesheet" href="<?= base_url('assets/css/print/request_internship.css') ?>">
</head>

<body>
	<div class="pagebreak">
		<div class="data">
			<!-- ข้อมูลนักเรียน -->
			<div class="bg" style="width: 50mm; top: 42.5mm; left: 55mm;">
				<?= 'นายพันธกิจ มะลิทอง' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 42.5mm; left: 133mm;">
				<?= '65309010002' ?>
			</div>
			<div class="bg" style="width: 5mm; top: 50mm; left: 23mm;">
				<?= '&check;' ?> <!-- ปวช -->
			</div>
			<div class="bg" style="width: 5mm; top: 50mm; left: 36mm;">
				<?= '&check;' ?> <!-- ปวส -->
			</div>
			<div class="bg text-center" style="width: 7mm; top: 50mm; left: 53mm;">
				<?= '1' ?> 
			</div>
			<div class="bg" style="width: 7mm; top: 50mm; left: 67mm;">
				<?= 'D1' ?> 
			</div>
			<div class="bg" style="width: 50mm; top: 50mm; left: 92mm;">
				<?= 'เทคโนโลยีสารสนเทศ' ?> 
			</div>
			<div class="bg" style="width: 50mm; top: 50mm; left: 140mm;">
				<?= 'นักพัฒนาซอฟต์แวร์คอมพิวเตอร์' ?> 
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 38mm;">
				<?= '3.91' ?> 
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 109mm;">
				<?= '1' ?> 
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 118mm;">
				<?= '2565' ?> 
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 149mm;">
				<?= '2' ?> 
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 158mm;">
				<?= '2565' ?> 
			</div>
			<div class="bg" style="width: 50mm; top: 64mm; left: 20mm;">
				<?= '1 มกราคม 2565' ?> 
			</div>
			<div class="bg" style="width: 50mm; top: 64mm; left: 75mm;">
				<?= '1 มกราคม 2565' ?> 
			</div>

			<!-- หาสถานที่ฝึกอาชีพเอง -->
			<div class="bg" style="width: 50mm; top: 71mm; left: 99mm;">
				<?= 'itc' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 78mm; left: 40mm;">
				<?= 'dev' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 78mm; left: 119mm;">
				<?= '122' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 78mm; left: 138mm;">
				<?= '----' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 85mm; left: 10mm;">
				<?= 'ในเมือง' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 85mm; left: 65mm;">
				<?= 'เมือง' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 85mm; left: 127mm;">
				<?= 'ชัยภูมิ' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 92mm; left: 23mm;">
				<?= '36000' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 92mm; left: 62mm;">
				<?= '0123456789' ?>
			</div>

			<!-- ให้วิทยาลัยหาสถานที่ฝึกอาชีพให้ -->
			<div class="bg" style="width: 50mm; top: 99mm; left: 111mm;">
				<?= 'itc' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 106mm; left: 9mm;">
				<?= '122' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 106mm; left: 37mm;">
				<?= '----' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 106mm; left: 87mm;">
				<?= 'ในเมือง' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 106mm; left: 132mm;">
				<?= 'เมือง' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 113mm; left: 13mm;">
				<?= 'ชัยภูมิ' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 113mm; left: 74mm;">
				<?= '36000' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 113mm; left: 113mm;">
				<?= '0123456789' ?>
			</div>

			<!-- ลายเซ็นต์ นร -->
			<div class="bg" style="width: 50mm; top: 134mm; left: 90mm;">
				<?= 'นายพันธกิจ มะลิทอง' ?>
			</div>
			<div class="bg signature text-center" style="width: 50mm; height: 13mm; top: 119mm; left: 93mm;">
				<img src="<?=base_url('assets/img/f7f3893eca1074d85a10759100b98301.png')?>" alt="" class="">
			</div>
		</div>
		<div class="text-center font-s-h">
			<b>
				หนังสือคําร้องขอฝึกอาชีพในสถานประกอบการ
			</b>
		</div>
		<br>
		<div class="text-right">
			เขียนที่............................................................
			<br>วันที่.........เดือน....................................พ.ศ...........
		</div>
		<p>
			เรื่อง ขอฝึกอาชีพในสถานประกอบการ
			<br>เรียน ผู้อํานวยการวิทยาลัยการอาชีพแก้งคร้อ
		</p>
		<p class="indent">
			ข้าพเจ้านาย/นางสาว..............................................................รหัสประจำตัว.........................................
			<br>นักศึกษาระดับ ( ) ปวช. ( ) ปวส. ปีที่.......กลุ่ม..........แผนกวิชา.......................................คณะวิชา...............................
			<br>มีผลการเรียนเฉลี่ยสะสม...............มีความประสงค์ขอฝึกอาชีพ ภาคเรียนที่ ....... /............ถึงภาคเรียนที่....... /............
			<br>ระหว่างวันที่................................................ถึงวันที่..................................................................
		</p>
		<p class="indent">
			1. หาสถานที่ฝึกอาชีพเองที่ (ช่ือสถานประกอบการ)..............................................................................
			<br>โปรดระบุตําแหน่งผู้ท่ีติดต่อ.............................................................................เลขที่.............ถนน...................................
			<br>ตําบล.................................................อําเภอ.........................................................จังหวัด................................................
			<br>รหัสไปรษณีย์....................................โทร.........................................................................................................................
		</p>
		<p class="indent">
			2. ให้วิทยาลัยหาสถานที่ฝึกอาชีพให้ (ชื่อสถานประกอบการ)............................................................
			<br>เลขที่......................ถนน.............................................ตําบล.......................................อําเภอ..........................................
			<br>จังหวัด.............................................รหัสไปรษณีย์.....................................โทร...............................................................
		</p>
		<p class="indent">
			จึงเรียนมาเพื่อโปรดทราบ
		<div class="text-right" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
			<br>นักเรียน นักศึกษา&emsp;&emsp;&emsp;
		</div>
		</p>
		<p>
			ความเห็นของผู้ปกครอง...................................................................................................................................................
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<p>
			ความเห็นของครูท่ีปรึกษา&emsp;&ensp; <span style="position: relative; bottom: -0.15em;">&#9711;</span> อนุญาต <span style="position: relative; bottom: -0.15em;">&#9711;</span> ได้ตรวจสอบคุณสมบัติของสถานประกอบการแล้ว
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<p>
			ความเห็นของหัวหน้าแผนกวิชา <span style="position: relative; bottom: -0.15em;">&#9711;</span> อนุญาต <span style="position: relative; bottom: -0.15em;">&#9711;</span> ได้ตรวจสอบคุณสมบัติของสถานประกอบการแล้ว
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<p>
			หัวหน้างานทวิภาคี........................................................................................................................................................
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<!-- &#9711; -->
	</div>

	<!-- <div class="pagebreak">
        <div class="data">
        </div>
        <div class="text-center font-s-h">
            <b>
                ประวัตินักเรียน นักศึกษาฝึกอาชีพ
            </b>
        </div>
        <br>
        <div class="" style="margin-left: 2em;">
            <ul>
                <li data-icon="๑. ">
                    ชื่อ - สกุล .........................................................ชั้น................กลุ่ม..........รหัสประจําตัว................................... วัน เดือน ปี เกิด...................................อายุ............ปี สูง...................เซนติเมตร น้ําหนัก..................กก. สัญชาติ....................เชื้อชาติ.................ศาสนา...............โรคประจําตัว......................ยาที่แพ้......................... กลุ่มเลือด........................โทรศัพท์....................................................................................................................
                </li>
                <li data-icon="๒. ">
                    ภูมิลําเนาเดิม.................................................................................................................................................... .........................................................................................................................................................................
                </li>
                <li data-icon="๓. ">
                    ที่อยู่ปัจจุบัน.....................................................................................................................................................
                    เพื่อนที่สนิทชื่อ.....................................ที่อยู่....................................................................................................
                    ........................................................................................................................................................................
                </li>
                <li data-icon="๔. ">
                    ชื่อบิดา.........................................................อายุ................ปี อาชีพ............................................................
                    <br>ชื่อมารดา.....................................................อายุ................ปี อาชีพ............................................................
                    <br>ที่อยู่บิดา - มารดา......................................................................................................................................... ......................................................................................................................................................................
                </li>
                <li data-icon="๕. ">
                    ชื่อผู้ปกครอง ในขณะศึกษาอยู่ ชื่อ - สกุล ................................................................................................ เกี่ยวข้องเป็น...............ที่อยู่.......................................................................................................................... .........................................................................................โทรศัพท์...............................................................
                </li>
                <li data-icon="๖. ">
                    คะแนนเฉลี่ยสะสมถึงภาคเรียนสุดท้าย.........................................................................................................
                </li>
                <li data-icon="๗. ">
                    ความสามารถพิเศษ&ensp;
                    ๑......................................................................................
                    <br>&emsp;&emsp;&emsp;&emsp;&emsp;&ensp; ๒......................................................................................
                    <br>&emsp;&emsp;&emsp;&emsp;&emsp;&ensp; ๓......................................................................................
                </li>
                <li data-icon="๘. ">
                    บุคคลที่สามารถให้ข้อมูลเกี่ยวกับนักเรียน นักศึกษาได้ ชื่อ - สกุล............................................................ อาชีพ........................................ที่อยู่/ที่ทํางาน............................................................................................... ........................................................................................................................................................................ โทรศัพท์..........................................................................................................................................................
                </li>
                <li data-icon="๙. ">
                    ครูที่ปรึกษาชื่อ...............................................................................................................................................
                    <br>ครูนิเทศชื่อ....................................................................................................................................................
                </li>
            </ul>
        </div>
    </div> -->

	<!-- <div class="pagebreak">
        <div class="data">
        </div>
        <div class="text-center font-s-h">
            <b>
                เขียนแผนที่ตั้งจากวิทยาลัย ถึงสถานประกอบการ
            </b>
        </div>
        <div class="map-box"></div>

        <p class="text-center">
            แผนที่โดยสังเขป โปรดระบุถนนใหญ่ ซอย ระยะทางที่สังเกตได้ง่าย
        </p>
        <br>
        <p>
            ชื่อสถานประกอบการ...................................................................................................................................................... ที่ตั้งเลขที่.........................หมู่ที่............................ตรอก/ซอย....................................ถนน............................................... ตําบล................................................อําเภอ....................................................จังหวัด..................................................... โทรศัพท์.......................................................................................................................................................................... สถานที่อยู่ใกล้เคียง และสังเกตได้ง่าย คือ....................................................................................................................
        </p>
        <p>
            ชื่อนักเรียน นักศึกษาที่เข้ารับการฝึกอาชีพ
        </p>
        <p>
            1. .....................................................................แผนก.......................................................ระดับ...................
            <br>2. .....................................................................แผนก.......................................................ระดับ...................
            <br>3. .....................................................................แผนก.......................................................ระดับ...................
            <br>4. .....................................................................แผนก.......................................................ระดับ...................
            <br>5. .....................................................................แผนก.......................................................ระดับ...................
            <br>6. .....................................................................แผนก.......................................................ระดับ...................
            <br>7. .....................................................................แผนก.......................................................ระดับ...................
        </p>
    </div> -->


	<script type="text/javascript">
		// window.onload = function() {
		// 	window.print();
		// }
	</script>
</body>

</html>
