<?php
defined('BASEPATH') or exit('No direct script access allowed');
?>
<!DOCTYPE html>
<html>

<head>
	<meta charset="UTF-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>หนังสือคําร้องขอฝึกอาชีพในสถานประกอบการ</title>

	<link rel="stylesheet" href="<?= base_url('assets/font/font.css') ?>">
	<link rel="stylesheet" href="<?= base_url('assets/css/reset.css') ?>">
	<link rel="stylesheet" href="<?= base_url('assets/css/print/request_internship.css') ?>">
</head>

<body>
	<div class="pagebreak">
		<div class="data">
			<!-- ข้อมูลนักเรียน -->
			<div class="bg" style="width: 50mm; top: 42.5mm; left: 55mm;">
				<?= (isset($in['title']) ? $in['title'] : '') . (isset($in['FirstName']) ? $in['FirstName'] : '') . ' ' . (isset($in['LastName']) ? $in['LastName'] : '') ?>

			</div>
			<div class="bg" style="width: 50mm; top: 42.5mm; left: 133mm;">
				<?= isset($in['code']) ? $in['code'] : '' ?>
			</div>
			<div class="bg" style="width: 5mm; top: 50mm; left: 23mm;">
				<?= '' ?>
				<!-- ปวช -->
			</div>
			<div class="bg" style="width: 5mm; top: 50mm; left: 36mm;">
				<?= '' ?>
				<!-- ปวส -->
			</div>
			<div class="bg text-center" style="width: 7mm; top: 50mm; left: 53mm;">
				<?= isset($in['group']) ? $in['group'] : '' ?>
			</div>
			<div class="bg" style="width: 7mm; top: 50mm; left: 67mm;">
				<?= isset($in['dep']) ? $in['dep'] : '' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 50mm; left: 92mm;">
				<?= '' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 50mm; left: 140mm;">
				<?= '' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 38mm;">
				<?= '' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 109mm;">
				<?= '' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 109mm;">
				<?= '' ?>
			</div>


			<div class="bg" style="width: 50mm; top: 70.5mm; left: 92mm;">
				<?= '' ?>
			</div>
			<div class="bg text-center" style="width: 10mm; top: 78mm; left: 106mm;">
				<?= '' ?>
			</div>
			<div class="bg text-center" style="width: 12mm; top: 78mm; left: 116mm;">
				<?= '' ?>
			</div>
			<div class="bg text-center" style="width: 10mm; top: 78mm; left: 146mm;">
				<?= '' ?>
			</div>
			<div class="bg text-center" style="width: 12mm; top: 78mm; left: 157mm;">
				<?= '' ?>
			</div>
			<div class="bg text-center" style="width: 43mm; top: 85mm; left: 19mm;">
				<?= '' ?>
			</div>
			<div class="bg text-center" style="width: 43mm; top: 85mm; left: 75mm;">
				<?= '' ?>
			</div>
			<div class="bg text-center" style="width: 80mm; top: 92mm; left: 98mm;">
				<?= '' ?>
			</div>
		</div>
		<div class="text-center font-s-h">
			<b>
				หนังสือคําร้องขอฝึกอาชีพในสถานประกอบการ
			</b>
		</div>
		<br>
		<div class="text-right">
			เขียนที่............................................................
			<br>วันที่.........เดือน....................................พ.ศ...........
		</div>
		<p>
			เรื่อง ขอฝึกอาชีพในสถานประกอบการ
			<br>เรียน ผู้อํานวยการวิทยาลัยการอาชีพแก้งคร้อ
		</p>
		<p class="indent">
			ข้าพเจ้านาย/นางสาว..............................................................รหัสประจำตัว.........................................
			<br>นักศึกษาระดับ ( ) ปวช. ( ) ปวส. ปีที่.......กลุ่ม..........แผนกวิชา.......................................คณะวิชา...............................
			<br>มีผลการเรียนเฉลี่ยสะสม...............มีความประสงค์ขอฝึกอาชีพ ภาคเรียนที่ ....... /............ถึงภาคเรียนที่....... /............
			<br>ระหว่างวันที่................................................ถึงวันที่..................................................................
		</p>
		<p class="indent">
			1. หาสถานที่ฝึกอาชีพเองที่ (ช่ือสถานประกอบการ)..............................................................................
			<br>โปรดระบุตําแหน่งผู้ท่ีติดต่อ.................................................................................เลขที่..........ถนน..................................
			<br>ตําบล.................................................อําเภอ.........................................................จังหวัด................................................
			<br>รหัสไปรษณีย์....................................โทร.........................................................................................................................
		</p>
		<p class="indent">
			2. ให้วิทยาลัยหาสถานที่ฝึกอาชีพให้ (ชื่อสถานประกอบการ)............................................................
			<br>เลขที่......................ถนน.............................................ตําบล.......................................อําเภอ..........................................
			<br>จังหวัด.............................................รหัสไปรษณีย์.....................................โทร...............................................................
		</p>
		<p class="indent">
			จึงเรียนมาเพื่อโปรดทราบ
		<div class="text-right" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
			<br>นักเรียน นักศึกษา&emsp;&emsp;&emsp;
		</div>
		</p>
		<p>
			ความเห็นของผู้ปกครอง...................................................................................................................................................
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<p>
			ความเห็นของครูท่ีปรึกษา&emsp;&ensp; <span style="position: relative; bottom: -0.15em;">&#9711;</span> อนุญาต <span style="position: relative; bottom: -0.15em;">&#9711;</span> ได้ตรวจสอบคุณสมบัติของสถานประกอบการแล้ว
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<p>
			ความเห็นของหัวหน้าแผนกวิชา <span style="position: relative; bottom: -0.15em;">&#9711;</span> อนุญาต <span style="position: relative; bottom: -0.15em;">&#9711;</span> ได้ตรวจสอบคุณสมบัติของสถานประกอบการแล้ว
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<p>
			หัวหน้างานทวิภาคี........................................................................................................................................................
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<!-- &#9711; -->
	</div>

	<!-- <div class="pagebreak">
        <div class="data">
        </div>
        <div class="text-center font-s-h">
            <b>
                ประวัตินักเรียน นักศึกษาฝึกอาชีพ
            </b>
        </div>
        <br>
        <div class="" style="margin-left: 2em;">
            <ul>
                <li data-icon="๑. ">
                    ชื่อ - สกุล .........................................................ชั้น................กลุ่ม..........รหัสประจําตัว................................... วัน เดือน ปี เกิด...................................อายุ............ปี สูง...................เซนติเมตร น้ําหนัก..................กก. สัญชาติ....................เชื้อชาติ.................ศาสนา...............โรคประจําตัว......................ยาที่แพ้......................... กลุ่มเลือด........................โทรศัพท์....................................................................................................................
                </li>
                <li data-icon="๒. ">
                    ภูมิลําเนาเดิม.................................................................................................................................................... .........................................................................................................................................................................
                </li>
                <li data-icon="๓. ">
                    ที่อยู่ปัจจุบัน.....................................................................................................................................................
                    เพื่อนที่สนิทชื่อ.....................................ที่อยู่....................................................................................................
                    ........................................................................................................................................................................
                </li>
                <li data-icon="๔. ">
                    ชื่อบิดา.........................................................อายุ................ปี อาชีพ............................................................
                    <br>ชื่อมารดา.....................................................อายุ................ปี อาชีพ............................................................
                    <br>ที่อยู่บิดา - มารดา......................................................................................................................................... ......................................................................................................................................................................
                </li>
                <li data-icon="๕. ">
                    ชื่อผู้ปกครอง ในขณะศึกษาอยู่ ชื่อ - สกุล ................................................................................................ เกี่ยวข้องเป็น...............ที่อยู่.......................................................................................................................... .........................................................................................โทรศัพท์...............................................................
                </li>
                <li data-icon="๖. ">
                    คะแนนเฉลี่ยสะสมถึงภาคเรียนสุดท้าย.........................................................................................................
                </li>
                <li data-icon="๗. ">
                    ความสามารถพิเศษ&ensp;
                    ๑......................................................................................
                    <br>&emsp;&emsp;&emsp;&emsp;&emsp;&ensp; ๒......................................................................................
                    <br>&emsp;&emsp;&emsp;&emsp;&emsp;&ensp; ๓......................................................................................
                </li>
                <li data-icon="๘. ">
                    บุคคลที่สามารถให้ข้อมูลเกี่ยวกับนักเรียน นักศึกษาได้ ชื่อ - สกุล............................................................ อาชีพ........................................ที่อยู่/ที่ทํางาน............................................................................................... ........................................................................................................................................................................ โทรศัพท์..........................................................................................................................................................
                </li>
                <li data-icon="๙. ">
                    ครูที่ปรึกษาชื่อ...............................................................................................................................................
                    <br>ครูนิเทศชื่อ....................................................................................................................................................
                </li>
            </ul>
        </div>
    </div> -->

	<!-- <div class="pagebreak">
        <div class="data">
        </div>
        <div class="text-center font-s-h">
            <b>
                เขียนแผนที่ตั้งจากวิทยาลัย ถึงสถานประกอบการ
            </b>
        </div>
        <div class="map-box"></div>

        <p class="text-center">
            แผนที่โดยสังเขป โปรดระบุถนนใหญ่ ซอย ระยะทางที่สังเกตได้ง่าย
        </p>
        <br>
        <p>
            ชื่อสถานประกอบการ...................................................................................................................................................... ที่ตั้งเลขที่.........................หมู่ที่............................ตรอก/ซอย....................................ถนน............................................... ตําบล................................................อําเภอ....................................................จังหวัด..................................................... โทรศัพท์.......................................................................................................................................................................... สถานที่อยู่ใกล้เคียง และสังเกตได้ง่าย คือ....................................................................................................................
        </p>
        <p>
            ชื่อนักเรียน นักศึกษาที่เข้ารับการฝึกอาชีพ
        </p>
        <p>
            1. .....................................................................แผนก.......................................................ระดับ...................
            <br>2. .....................................................................แผนก.......................................................ระดับ...................
            <br>3. .....................................................................แผนก.......................................................ระดับ...................
            <br>4. .....................................................................แผนก.......................................................ระดับ...................
            <br>5. .....................................................................แผนก.......................................................ระดับ...................
            <br>6. .....................................................................แผนก.......................................................ระดับ...................
            <br>7. .....................................................................แผนก.......................................................ระดับ...................
        </p>
    </div> -->


	<script type="text/javascript">
		// window.onload = function() {
		// window.print();
		// }
	</script>
</body>

</html>
