<?php
defined('BASEPATH') or exit('No direct script access allowed');
?>
<!DOCTYPE html>
<html>

<head>
	<meta charset="UTF-8">
	<meta http-equiv="X-UA-Compatible" content="IE=edge">
	<meta name="viewport" content="width=device-width, initial-scale=1.0">
	<title>หนังสือคําร้องขอฝึกอาชีพในสถานประกอบการ</title>

	<link rel="stylesheet" href="<?= base_url('assets/font/font.css') ?>">
	<link rel="stylesheet" href="<?= base_url('assets/css/reset.css') ?>">
	<link rel="stylesheet" href="<?= base_url('assets/css/print/request_internship.css') ?>">
</head>

<body>
	<div class="pagebreak">
		<div class="data">
			<!-- ข้อมูลนักเรียน -->
			<div class="bg" style="width: 50mm; top: 42.5mm; left: 55mm;">
				<?= (isset($in['title']) ? $in['title'] : '') . (isset($in['firstname']) ? $in['firstname'] : '') . ' ' . (isset($in['lastname']) ? $in['lastname'] : '') ?>

			</div>
			<div class="bg" style="width: 50mm; top: 42.5mm; left: 133mm;">
				<?= isset($in['std_code']) ? $in['std_code'] : '' ?>
			</div>
			<div class="bg" style="width: 5mm; top: 50mm; left: 23mm;">
				<?= isset($in['class']) && $in['class'] == 'ปวช' ? '&check;' : '' ?>
				<!-- ปวช -->
			</div>
			<div class="bg" style="width: 5mm; top: 50mm; left: 36mm;">
				<?= isset($in['class']) && $in['class'] == 'ปวส' ? '&check;' : '' ?>
				<!-- ปวส -->
			</div>
			<div class="bg text-center" style="width: 7mm; top: 50mm; left: 53mm;">
				<?= '' ?>
			</div>
			<div class="bg" style="width: 7mm; top: 50mm; left: 67mm;">
				<?= isset($in['group']) ? $in['group'] : '' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 50mm; left: 92mm;">
				<?php
				if (isset($in['dep'])) {
					$dep = $this->db->get_where('majors', ['id' => $in['dep']])->row();
					echo isset($dep->major_name) ? $dep->major_name : '';
				}
				?>
			</div>
			<div class="bg" style="width: 50mm; top: 50mm; left: 140mm;">
				<?php
				if (isset($in['minor'])) {
					$minor = $this->db->get_where('minors', ['id' => $in['minor']])->row();
					echo isset($minor->minor_name) ? $minor->minor_name : '';
				}
				?>
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 38mm;">
				<?= isset($in['grade']) ? $in['grade'] : '' ?>
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 109mm;">
				<?php
				if (!empty($in['year_form'])) {
					echo explode('/', $in['year_form'])[0];
				}
				?>
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 118mm;">
				<?php
				if (!empty($in['year_form'])) {
					echo explode('/', $in['year_form'])[1];
				}
				?>
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 149mm;">
				<?php
				if (!empty($in['year_to'])) {
					echo explode('/', $in['year_form'])[0];
				}
				?>
			</div>
			<div class="bg" style="width: 50mm; top: 57mm; left: 158mm;">
				<?php
				if (!empty($in['year_to'])) {
					echo explode('/', $in['year_form'])[1];
				}
				?>
			</div>
			<div class="bg" style="width: 50mm; top: 64mm; left: 20mm;">
				<?php
				if (!empty($in['date_form'])) {
					echo $this->sawasdee->toThaiDateTime($in['date_form'], '%d %m %y');
				}
				?>
			</div>
			<div class="bg" style="width: 50mm; top: 64mm; left: 75mm;">
				<?php
				if (!empty($in['date_to'])) {
					echo $this->sawasdee->toThaiDateTime($in['date_to'], '%d %m %y');
				}
				?>
			</div>

			<!-- หาสถานที่ฝึกอาชีพเอง -->
			<?php
			if (!empty($in['location'])) {
				if (!empty($in['location'] && $in['location'] == '1')) { ?>
					<div class="bg" style="width: 50mm; top: 71mm; left: 99mm;">
						<?= isset($in['name_lo']) ? $in['name_lo'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 78mm; left: 40mm;">
						<?= isset($in['position']) ? $in['position'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 78mm; left: 122mm;">
						<?= isset($in['number']) ? $in['number'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 78mm; left: 140mm;">
						<?= isset($in['road']) ? $in['road'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 85mm; left: 10mm;">
						<?= isset($in['sub_district']) ? $in['sub_district'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 85mm; left: 65mm;">
						<?= isset($in['district']) ? $in['district'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 85mm; left: 127mm;">
						<?= isset($in['provice']) ? $in['provice'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 92mm; left: 23mm;">
						<?= isset($in['code_p']) ? $in['code_p'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 92mm; left: 62mm;">
						<?= isset($in['tel']) ? $in['tel'] : '' ?>
					</div>
			<?php
				}
			}
			?>


			<!-- ให้วิทยาลัยหาสถานที่ฝึกอาชีพให้ -->
			<?php
			if (!empty($in['location'])) {
				if (!empty($in['location'] && $in['location'] == '2')) {
			?>
					<div class="bg" style="width: 50mm; top: 99mm; left: 111mm;">
						<?= isset($in['name_lo']) ? $in['name_lo'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 106mm; left: 9mm;">
						<?= isset($in['number']) ? $in['number'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 106mm; left: 37mm;">
						<?= isset($in['road']) ? $in['road'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 106mm; left: 87mm;">
						<?= isset($in['sub_district']) ? $in['sub_district'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 106mm; left: 132mm;">
						<?= isset($in['district']) ? $in['district'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 113mm; left: 13mm;">
						<?= isset($in['provice']) ? $in['provice'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 113mm; left: 74mm;">
						<?= isset($in['code_p']) ? $in['code_p'] : '' ?>
					</div>
					<div class="bg" style="width: 50mm; top: 113mm; left: 113mm;">
						<?= isset($in['tel']) ? $in['tel'] : '' ?>
					</div>

			<?php
				}
			}
			?>

			<!-- ลายเซ็นต์ นร -->
			<div class="bg" style="width: 50mm; top: 134mm; left: 90mm;">
				<?= (isset($in['title']) ? $in['title'] : '') . (isset($in['firstname']) ? $in['firstname'] : '') . ' ' . (isset($in['lastname']) ? $in['lastname'] : '') ?>
			</div>
			<div class="bg signature text-center" style="width: 50mm; height: 13mm; top: 119mm; left: 93mm;">
				<?php
				$sign_std = $this->db->get_where('users', ['std_id' => $in['std_code']])->row();
				?>
				<img src="<?= base_url('storage/' . (isset($sign_std->std_img) ? $sign_std->std_img : '')) ?>" alt="" class="">
			</div>

		</div>
		<div class="text-center font-s-h">
			<b>
				หนังสือคําร้องขอฝึกอาชีพในสถานประกอบการ
			</b>
		</div>
		<br>
		<div class="text-right">
			เขียนที่............................................................
			<br>วันที่.........เดือน....................................พ.ศ...........
		</div>
		<p>
			เรื่อง ขอฝึกอาชีพในสถานประกอบการ
			<br>เรียน ผู้อํานวยการวิทยาลัยการอาชีพแก้งคร้อ
		</p>
		<p class="indent">
			ข้าพเจ้านาย/นางสาว..............................................................รหัสประจำตัว.........................................
			<br>นักศึกษาระดับ ( ) ปวช. ( ) ปวส. ปีที่.......กลุ่ม..........แผนกวิชา.......................................คณะวิชา...............................
			<br>มีผลการเรียนเฉลี่ยสะสม...............มีความประสงค์ขอฝึกอาชีพ ภาคเรียนที่ ....... /............ถึงภาคเรียนที่....... /............
			<br>ระหว่างวันที่................................................ถึงวันที่..................................................................
		</p>
		<p class="indent">
			1. หาสถานที่ฝึกอาชีพเองที่ (ช่ือสถานประกอบการ)..............................................................................
			<br>โปรดระบุตําแหน่งผู้ท่ีติดต่อ.................................................................................เลขที่..........ถนน..................................
			<br>ตําบล.................................................อําเภอ.........................................................จังหวัด................................................
			<br>รหัสไปรษณีย์....................................โทร.........................................................................................................................
		</p>
		<p class="indent">
			2. ให้วิทยาลัยหาสถานที่ฝึกอาชีพให้ (ชื่อสถานประกอบการ)............................................................
			<br>เลขที่......................ถนน.............................................ตําบล.......................................อําเภอ..........................................
			<br>จังหวัด.............................................รหัสไปรษณีย์.....................................โทร...............................................................
		</p>
		<p class="indent">
			จึงเรียนมาเพื่อโปรดทราบ
		<div class="text-right" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
			<br>นักเรียน นักศึกษา&emsp;&emsp;&emsp;
		</div>
		</p>
		<p>
			ความเห็นของผู้ปกครอง...................................................................................................................................................
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<p>
			ความเห็นของครูท่ีปรึกษา&emsp;&ensp; <span style="position: relative; bottom: -0.15em;">&#9711;</span> อนุญาต <span style="position: relative; bottom: -0.15em;">&#9711;</span> ได้ตรวจสอบคุณสมบัติของสถานประกอบการแล้ว
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<p>
			ความเห็นของหัวหน้าแผนกวิชา <span style="position: relative; bottom: -0.15em;">&#9711;</span> อนุญาต <span style="position: relative; bottom: -0.15em;">&#9711;</span> ได้ตรวจสอบคุณสมบัติของสถานประกอบการแล้ว
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<p>
			หัวหน้างานทวิภาคี........................................................................................................................................................
		<div class="text-right mt" style="padding-right: 4em;">
			ลงชื่อ............................................................
			<br>(.............................................................)&nbsp;
		</div>
		</p>
		<!-- &#9711; -->
	</div>

	<!-- <div class="pagebreak">
        <div class="data">
        </div>
        <div class="text-center font-s-h">
            <b>
                ประวัตินักเรียน นักศึกษาฝึกอาชีพ
            </b>
        </div>
        <br>
        <div class="" style="margin-left: 2em;">
            <ul>
                <li data-icon="๑. ">
                    ชื่อ - สกุล .........................................................ชั้น................กลุ่ม..........รหัสประจําตัว................................... วัน เดือน ปี เกิด...................................อายุ............ปี สูง...................เซนติเมตร น้ําหนัก..................กก. สัญชาติ....................เชื้อชาติ.................ศาสนา...............โรคประจําตัว......................ยาที่แพ้......................... กลุ่มเลือด........................โทรศัพท์....................................................................................................................
                </li>
                <li data-icon="๒. ">
                    ภูมิลําเนาเดิม.................................................................................................................................................... .........................................................................................................................................................................
                </li>
                <li data-icon="๓. ">
                    ที่อยู่ปัจจุบัน.....................................................................................................................................................
                    เพื่อนที่สนิทชื่อ.....................................ที่อยู่....................................................................................................
                    ........................................................................................................................................................................
                </li>
                <li data-icon="๔. ">
                    ชื่อบิดา.........................................................อายุ................ปี อาชีพ............................................................
                    <br>ชื่อมารดา.....................................................อายุ................ปี อาชีพ............................................................
                    <br>ที่อยู่บิดา - มารดา......................................................................................................................................... ......................................................................................................................................................................
                </li>
                <li data-icon="๕. ">
                    ชื่อผู้ปกครอง ในขณะศึกษาอยู่ ชื่อ - สกุล ................................................................................................ เกี่ยวข้องเป็น...............ที่อยู่.......................................................................................................................... .........................................................................................โทรศัพท์...............................................................
                </li>
                <li data-icon="๖. ">
                    คะแนนเฉลี่ยสะสมถึงภาคเรียนสุดท้าย.........................................................................................................
                </li>
                <li data-icon="๗. ">
                    ความสามารถพิเศษ&ensp;
                    ๑......................................................................................
                    <br>&emsp;&emsp;&emsp;&emsp;&emsp;&ensp; ๒......................................................................................
                    <br>&emsp;&emsp;&emsp;&emsp;&emsp;&ensp; ๓......................................................................................
                </li>
                <li data-icon="๘. ">
                    บุคคลที่สามารถให้ข้อมูลเกี่ยวกับนักเรียน นักศึกษาได้ ชื่อ - สกุล............................................................ อาชีพ........................................ที่อยู่/ที่ทํางาน............................................................................................... ........................................................................................................................................................................ โทรศัพท์..........................................................................................................................................................
                </li>
                <li data-icon="๙. ">
                    ครูที่ปรึกษาชื่อ...............................................................................................................................................
                    <br>ครูนิเทศชื่อ....................................................................................................................................................
                </li>
            </ul>
        </div>
    </div> -->

	<!-- <div class="pagebreak">
        <div class="data">
        </div>
        <div class="text-center font-s-h">
            <b>
                เขียนแผนที่ตั้งจากวิทยาลัย ถึงสถานประกอบการ
            </b>
        </div>
        <div class="map-box"></div>

        <p class="text-center">
            แผนที่โดยสังเขป โปรดระบุถนนใหญ่ ซอย ระยะทางที่สังเกตได้ง่าย
        </p>
        <br>
        <p>
            ชื่อสถานประกอบการ...................................................................................................................................................... ที่ตั้งเลขที่.........................หมู่ที่............................ตรอก/ซอย....................................ถนน............................................... ตําบล................................................อําเภอ....................................................จังหวัด..................................................... โทรศัพท์.......................................................................................................................................................................... สถานที่อยู่ใกล้เคียง และสังเกตได้ง่าย คือ....................................................................................................................
        </p>
        <p>
            ชื่อนักเรียน นักศึกษาที่เข้ารับการฝึกอาชีพ
        </p>
        <p>
            1. .....................................................................แผนก.......................................................ระดับ...................
            <br>2. .....................................................................แผนก.......................................................ระดับ...................
            <br>3. .....................................................................แผนก.......................................................ระดับ...................
            <br>4. .....................................................................แผนก.......................................................ระดับ...................
            <br>5. .....................................................................แผนก.......................................................ระดับ...................
            <br>6. .....................................................................แผนก.......................................................ระดับ...................
            <br>7. .....................................................................แผนก.......................................................ระดับ...................
        </p>
    </div> -->


	<script type="text/javascript">
		window.onload = function() {
			window.print();
		}
	</script>
</body>

</html>
